### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_service.default[0] has changed
  ~ resource "aws_ecs_service" "default" {
      ~ iam_role                           = "aws-service-role" -> "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS"
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-prod-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-0b22d749517d906e0"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-0b22d749517d906e0" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
        name                  = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
+       role_last_used        = [
+           {
+               last_used_date = "2023-04-24T16:28:43Z"
+               region         = "us-west-2"
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-prod-api-ECSTask-2023030302392200850000000a"
        name                  = "gost-prod-api-ECSTask-2023030302392200850000000a"
+       role_last_used        = [
+           {
+               last_used_date = "2023-04-24T15:31:12Z"
+               region         = "us-west-2"
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
+       policy                      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           StringNotEquals = {
+                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
+                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           Null = {
+                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
+                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
+                   {
+                       Action    = "s3:*"
+                       Condition = {
+                           Bool = {
+                               "aws:SecureTransport" = "false"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*",
+                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api",
                        ]
+                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
        tags                        = {
            "Attributes" = "729134339726-us-west-2-api"
            "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
            "Namespace"  = "gost-prod"
        }
        # (10 unchanged attributes hidden)

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = 1
+           enabled                                = true
+           id                                     = "rule-1"
+           tags                                   = {}

+           expiration {
+               days                         = 14
+               expired_object_delete_marker = false
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] has changed
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 2467770368 -> 2737852416
              ~ value_in_standard = 2467770368 -> 2737852416
                # (1 unchanged element hidden)
            },
        ]
        tags                            = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
        # (11 unchanged attributes hidden)
    }

  # module.api.module.grants_scraper.aws_iam_role.default[0] has changed
  ~ resource "aws_iam_role" "default" {
        id                    = "gost-prod-grants_scraper-2023030302392250420000000b"
        name                  = "gost-prod-grants_scraper-2023030302392250420000000b"
+       role_last_used        = [
+           {
+               last_used_date = "2023-04-24T05:36:22Z"
+               region         = "us-west-2"
            },
        ]
        tags                  = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_appautoscaling_target.desired_count[0] will be updated in-place
  ~ resource "aws_appautoscaling_target" "desired_count" {
        id                 = "service/gost-prod/gost-prod-api"
      ~ min_capacity       = 1 -> 2
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:5" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
+                   dockerLabels           = {
+                       "com.datadoghq.tags.env"     = "production"
+                       "com.datadoghq.tags.service" = "gost"
+                       "com.datadoghq.tags.version" = "c5646dc2240f20830ddb465696491ad6b600f5af"
                    }
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "dev" -> "c5646dc2240f20830ddb465696491ad6b600f5af"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "true"
                        },
                        # (4 unchanged elements hidden)
                        {
                            name  = "NOTIFICATIONS_EMAIL"
                            value = "grants-notifications@grants.usdigitalresponse.org"
                        },
+                       {
+                           name  = "PGSSLROOTCERT"
+                           value = "rds-combined-ca-bundle.pem"
                        },
                        {
                            name  = "VUE_APP_GRANTS_API_URL"
                            value = "https://1ist1822ik.execute-api.us-west-2.amazonaws.com"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name                   = "api"
                    # (10 unchanged elements hidden)
                } # forces replacement,
              ~ {
+                   dockerLabels           = {
+                       "com.datadoghq.tags.env"     = "production"
+                       "com.datadoghq.tags.service" = "gost"
+                       "com.datadoghq.tags.version" = "c5646dc2240f20830ddb465696491ad6b600f5af"
                    }
                  ~ environment            = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "dev" -> "c5646dc2240f20830ddb465696491ad6b600f5af"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
                    name                   = "datadog"
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-prod-api" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy.task["connect-to-postgres"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-prod-api-ECSTask-2023030302392200850000000a:connect-to-postgres"
        name   = "connect-to-postgres"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:us-west-2:729134339726:dbuser:cluster-36SARLZWML2BV46TW2KQUXXK6I/postgres" -> "arn:aws:rds-db:us-west-2:729134339726:dbuser:cluster-36SARLZWML2BV46TW2KQUXXK6I/postgres"
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_ssm_parameter.postgres_connection_string[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "postgres_connection_string" {
-       allowed_pattern = "" -> null
        id              = "/gost/prod/postgres/connection_string"
+       insecure_value  = (known after apply)
        name            = "/gost/prod/postgres/connection_string"
        tags            = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.postgres.random_password.postgres_user will be created
+   resource "random_password" "postgres_user" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-prod-grants_scraper-2023030302392250420000000b:terraform-20230303024046969200000014"
        name   = "terraform-20230303024046969200000014"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-prod-grants_scraper-20230303024046967600000013"
        name                         = "gost-prod-grants_scraper-20230303024046967600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:5" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.postgres.module.db.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "gost-prod-postgres-20230303023912395800000006"
      ~ master_password                     = (sensitive value)
        tags                                = {}
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres.module.db.aws_security_group_rule.default_ingress[0] will be destroyed
  # (because aws_security_group_rule.default_ingress is not in configuration)
-   resource "aws_security_group_rule" "default_ingress" {
-       description              = "From allowed SGs" -> null
-       from_port                = 5432 -> null
-       id                       = "sgrule-839165207" -> null
-       protocol                 = "tcp" -> null
-       security_group_id        = "sg-0124e95c0312a83ce" -> null
-       security_group_rule_id   = "sgr-0255c6ed1b5c78acb" -> null
-       self                     = false -> null
-       source_security_group_id = "sg-02a2851f809e91e7b" -> null
-       to_port                  = 5432 -> null
-       type                     = "ingress" -> null
    }

  # module.postgres.module.db.aws_security_group_rule.this["from_api"] will be created
+   resource "aws_security_group_rule" "this" {
+       from_port                = 5432
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = "sg-0124e95c0312a83ce"
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = "sg-02a2851f809e91e7b"
+       to_port                  = 5432
+       type                     = "ingress"
    }

  # module.postgres.module.db.random_password.master_password[0] will be destroyed
  # (because random_password.master_password is not in configuration)
-   resource "random_password" "master_password" {
-       bcrypt_hash = (sensitive value)
-       id          = "none" -> null
-       length      = 10 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = (sensitive value)
-       special     = false -> null
-       upper       = true -> null
    }

Plan: 3 to add, 7 to change, 3 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*